#ifndef CFLINT_H
#define CFLINT_H
//C std lib
//遵守C99标准
#include <stdint.h>
#include <stdbool.h>

/*Cfint(Abbr):
 *C Functions For Large Integers In Number Theory And Cryptography
 *大数理论与密码学的C函数集
 */

/* 部分预先配置项 */
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 平台大小端序检查,用于修订下述宏的配置情况 */
uint8_t Cflint_CheckEndian(void);
/* 大小端序配置项 */
#define CFLINT_ENDIAN   1
/* 平台字节对齐检查,用于修订下述宏的配置情况 */
uint8_t Cflint_CheckBytes(void);
/* 平台字节对齐配置项 */
#define CFLINT_BYTE     8



/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 大小端序配置项 */
#if 0
#elif   CFLINT_ENDIAN == 0
#define CFLINT_ENDIAN_BIG
#elif   CFLINT_ENDIAN == 1
#define CFLINT_ENDIAN_LITTLE
#else
#error  "Error Configure:Port Endian"
#endif
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 平台字节对齐类型定义 */
#if 0
#elif   CFLINT_BYTE == 1
#define CFLINT_BYTES    uint8_t
#elif   CFLINT_BYTE == 2
#define CFLINT_BYTES    uint16_t
#elif   CFLINT_BYTE == 4
#define CFLINT_BYTES    uint32_t
#elif   CFLINT_BYTE == 8
#define CFLINT_BYTES    uint64_t
#else
#error  "Error Configure:Port Byte Alignment"
#endif
#define CFINT_TYPE      CFLINT_BYTE
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*  */



/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
#define CFLINT_USE_AES128
#ifdef  CFLINT_USE_AES128
/* AES128加(Flag:0)解(Flag:1)密 */
void AES128_Run(uint8_t *Text, uint32_t Length, uint8_t Key[16], uint8_t Flag);
#endif
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/


#endif
