#ifndef SGUICOMMON_H
#define SGUICOMMON_H
/* 标准库依赖 */
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 链表宏迭代器(可改写为静态内联函数提升效率) */
#include "SGuiIterator.h"
/* 上述的声明及其对应的源可以被单独提取到module中 */
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 将一个空闲单元加入节点,并加入到链表(使用最小化索引) */
void SGuiSNodeUnitAdd(SGuiSNode *head, SGuiSNode *tail, void *unit);
/* 将一个空闲单元移除节点,并移除出链表(使用最小化索引) */
void SGuiSNodeUnitRemove(SGuiSNode *head, SGuiSNode *tail, void *unit);
/* 将一个空闲单元寻找到(使用最小化索引) */
void * SGuiSNodeUnitSearch(SGuiSNode *head, SGuiSNode *tail, uint32_t index);
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*实现目标:
 *一些通用的宏配置或内联功能
 */
#define SGUIMIN(data1, data2) ((data1) <= (data2) ? (data1) : (data2))
#define SGUIMAX(data1, data2) ((data1) >= (data2) ? (data1) : (data2))

#endif
