#include "Cflint.h"
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
#ifdef CFLINT_USE_FUNCTION_SET5
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 大随机数生成 */
void Cflint_Random(CFLINT_TYPE  *Operand, uint32_t Length,
                   CFLINT_TYPE (*Random)(void))
{
    /* 这里直接以最简单的方式生成即可,但要逆向生成 */
    /* 因为随机数的目标是每一个bit位都随机 */
    /* 那么大小随机数均可完成该功能 */
    for (uint32_t Index = 0; Index < Length; Index++)
        Operand[Length - Index - 1] = Random();
}
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 孪生素数判别检查 */
bool Cflint_IsPrime1(CFLINT_TYPE *X, CFLINT_TYPE *Temp[3], uint32_t Length)
{
    /* 固有开销 */
    CFLINT_TYPE *Module   = Temp[1];
    CFLINT_TYPE *Divisor  = Temp[2];
    /* 单独检查:2, 3 */
    Cflint_SetValue(Module, Length, 0);
    /* 单独检查:生成2,匹配2 */
    Module[0] = 2;
    if(Cflint_Equal(X, Module, Length) == true)
        return true;
    /* 单独检查:生成3,匹配3 */
    Module[0] = 3;
    if(Cflint_Equal(X, Module, Length) == true)
        return true;
    /* 解算:Module = X % 6 */
    Cflint_SetValue(Divisor, Length, 0);
    Divisor[0] = 6;
    Cflint_Modulo(Module, X, Divisor, Length);
    /* 验证是否为孪生素数1:(6 * N - 1) % 6 = 5 */
    Divisor[0] = 5;
    if(Cflint_Equal(Divisor, Module, Length) == true)
        return true;
    /* 验证是否为孪生素数2:(6 * N + 1) % 6 = 1 */
    Divisor[0] = 1;
    if(Cflint_Equal(Divisor, Module, Length) == true)
        return true;
    return false;
}
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
#endif
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/