#ifndef CFLINT_TEST_H
#define CFLINT_TEST_H
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
void Test_CflintFunctionSet1(void);
void Test_CflintFunctionSet2(void);
void Test_CflintFunctionSet3(void);
void Test_CflintFunctionSet4(void);
void Test_CflintFunctionSet5(void);
void Test_CflintFunctionSet6(void);
void Test_CflintFunctionSet7(void);
void Test_CflintFunctionSet8(void);
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 测试蒙哥马利模(未完成,测试未通过) */
void Test_Mentgomery(void);
/* 测试椭圆曲线(未完成,测试未通过) */
void Test_ECC(void);
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
#endif
