#include "SGui_Kernel.h"
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 实现目标:
 * 设计简要的容器管理阵列
 * 容器是一个控件属性, 用于管理多子控件
 */
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 资源容器集合扩张缩减因子 */
/* 数量越大,额外维护空间越小 */
/* 数量越小,内存需求弹性越高 */
#define SGUISCALFACTOR    5
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
typedef struct SimpleGui_Container {
    uint32_t   Index;  //当前单元编号
    uint32_t   Number; //控件句柄数量
    uint32_t  *Source; //控件句柄集合
} SGui_Container;
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
static SGui_SList List = {0};
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 获得一个容器 */
uint32_t SGui_ContainerTake(void)
{
    uint32_t Index = 0;
    /* 1.生成一个空闲单元 */
    SGui_Container *Unit = SGUI_ALLOC(sizeof(SGui_Container));
    Unit->Number = SGUISCALFACTOR;
    Unit->Source = SGUI_ALLOC(sizeof(uint32_t) * (Unit->Number));
    /* 初始化空闲单元 */
    for (Index = 0; Index < Unit->Number; Index++)
        (Unit->Source)[Index] = SGUI_HANDLE_INVALID;
    /* 2.将空闲单元以最小化索引加入链表 */
    SGui_SNodeUnitAdd(&List, Unit);
    
    return Unit->Index;
}
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 释放一个容器 */
void SGui_ContainerGive(uint32_t Container)
{
    /* 1.搜索生成的空闲单元 */
    SGui_Container *Unit = SGui_SNodeUnitSearch(&List, Container);
    /* 2.释放一个空闲单元 */
    if (Unit == NULL);
    if (Unit != NULL) {
        /* 生成与释放顺序相反 */
        /* 虽然Unit会变成野指针,但我们不会拿它干坏事 */
        SGUI_FREE(Unit->Source);
        SGUI_FREE(Unit);
        /* 将空闲单元移除出以最小化索引链表 */
        SGui_SNodeUnitRemove(&List, Unit);
    }
}
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 容器添加一个子控件 */
void SGui_ContainerAdd(uint32_t Container, uint32_t Handle)
{
    uint32_t Index = 0;
    /* 1.搜索生成的空闲单元 */
    SGui_Container *Unit = SGui_SNodeUnitSearch(&List, Container);
    /* 2.空闲单元添加资源 */
    if (Unit == NULL);
    if (Unit != NULL) {
        /* 遍历容器集合,将其添加到末尾 */
        for (Index = 0; Index < Unit->Number; Index++)
            if ((Unit->Source)[Index] == SGUI_HANDLE_INVALID)
                break;
    }
    if (Unit != NULL) {
        /* 如果遍历到了末尾 */
        if (Index == Unit->Number) {
            /* 生成一个扩展容器集合 */
            uint32_t  Number = Unit->Number + SGUISCALFACTOR;
            uint32_t *Source = SGUI_ALLOC(sizeof(uint32_t) * Number);
            /* 拷贝原生容器集合 */
            for (Index = 0; Index < Unit->Number; Index++)
                Source[Index] = (Unit->Source)[Index];
            /* 初始化扩展端部 */
             for (Index = Unit->Number; Index < Number; Index++)
                Source[Index] = SGUI_HANDLE_INVALID;
            /* 释放原生容器集合 */
            SGUI_FREE(Unit->Source);
            /*  */
            Index = Unit->Number;
            /* 设置扩展容器 */
            Unit->Source = Source;
            Unit->Number = Number;
        }
        /* 设置子控件 */
        (Unit->Source)[Index] = Handle;
    }
}
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 容器移除一个子控件 */
void SGui_ContainerRemove(uint32_t Container, uint32_t Handle)
{
    uint32_t Index = 0;
    /* 1.搜索生成的空闲单元 */
    SGui_Container *Unit = SGui_SNodeUnitSearch(&List, Container);
    /* 2.空闲单元移除资源 */
    if (Unit == NULL);
    if (Unit != NULL) {
        /* 遍历容器集合,寻找到目标资源 */
        for (Index = 0; Index < Unit->Number; Index++)
            if ((Unit->Source)[Index] == Handle) {
                (Unit->Source)[Index]  = SGUI_HANDLE_INVALID;
                break;
            }
    }
}
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 获取容器集合长度 */
void SGui_ContainerLengthGet(uint32_t Container, uint32_t *Number)
{
    uint32_t Index = 0;
    /* 1.搜索生成的空闲单元 */
    SGui_Container *Unit = SGui_SNodeUnitSearch(&List, Container);
    /* 2.空闲单元获取资源 */
    if (Unit == NULL)
        *Number = 0;
    if (Unit != NULL)
        *Number = Unit->Number;
}
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 获取容器集合 */
void SGui_ContainerSetGet(uint32_t Container, uint32_t *Source)
{
    uint32_t Index = 0;
    /* 1.搜索生成的空闲单元 */
    SGui_Container *Unit = SGui_SNodeUnitSearch(&List, Container);
    /* 2.空闲单元获取资源 */
    if (Unit == NULL);
    if (Unit != NULL)
        for (Index = 0; Index < Unit->Number; Index++)
            Source[Index] = (Unit->Source)[Index];
}
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
