#ifndef C_CLASS_H
#define C_CLASS_H
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 类抽象描述 */
typedef struct C_Class_Template {
    /* 基类指针:类型(C_Class *) */
    const void *BaseClass;
    /* 构造函数:参数类型(C_Object *) */
    void (*Constructor)(const void *Class, void *Object);
    /* 析构函数:参数类型(C_Object *) */
    void (*Destructor)(const void  *Class, void *Object);
    /* 实例类类型 */
    void *Type;
    /* 实例类尺寸大小 */
    uint32_t Size;
    /* 抽象属性x:实例类是否可xxx */
    /* 抽象属性x:... */
} C_Class;
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
#endif